/*
 * 	생성자
 * 	  = 인스턴스변수 / 정적변수 초기화
 * 		---------------------
 * 		=> 연산 / 제어 / 파일
 * 		=> 필요시에만 사용
 * 		=> 없는 경우 기본 생성자 자동 생성
 * 		=> 시작과 동시에 처리
 * 		   자동 로그인 / 데이터베이스 연동 / 화면UI...
 * 		=> 클래스명과 동일
 * 		=> 리턴형은 없음
 * 		=> 객체 저장시 호출 => new 생성자()
 * 		=> 여러개 만들수 있음
 * 		   오버로딩
 * 			= 메서드명 동일
 * 			= 매개변수 갯수 or 데이터형 다름
 * 			= 리턴형은 관계X
 * 			= 매개변수의 데이터형 => 찾을수 없는 경우 가장 가까운것을 찾음
 * 			= 같은 이름의 메서드를 이용해 새로운 기능을 만들때 사용
 * 			= 한개의 클래스 내에서 만듦
 * 		=> 초기화를 다른 값으로 저장 => 매개변수
 * 		=> 데이터베이스 : 드라이버이름
 * 		--------------------------------
 * 	초기화 : 1번만 수행
 * 	   인스턴스
 * 	   {
 * 	   }
 * 	   static
 * 	   {
 * 	   }
 * 	메서드
 */
public class 메서드_3 {

	public static void main(String[] args) {
		// TODO Auto-generated method stub
		
	}

}
